In [1]:
import mysql.connector as mysql

In [2]:
con = mysql.connect(user = 'root', password = '111111', database = 'employees', charset= 'utf8')

In [3]:
cur = con.cursor()

### БД

Всего 6 таблиц:

1) emp_info: Информация сотрудников

2) departments: отделы и количество сотрудников в отделе. Каждый человек может принадлежать только одному отделу.

3) dep_room: Номера комнат, где расположены отделы

4) projects: Проекты, участвующие сотрудниками. Каждый может участвовать в разных проектах

5) emp_pro: ID сотрудников и ID проектов

6) salary: Зарплаты сотрудников

In [36]:
try:
    sql_query='select * from emp_info'
    cur.execute(sql_query)
    print('emp_id', 'firstname', 'lastname', 'gender', 'depart_id')
    for i in cur:
        print(i)
except mysql.Error as e:
    print('query error!{}'.format(e))

emp_id firstname lastname gender depart_id
('e001', 'Василий', 'Жуковский', 'male', 'd03')
('e002', 'Валерий', 'Брюсов', 'male', 'd02')
('e003', 'Сергей', 'Довлатов', 'male', 'd01')
('e004', 'Федор', 'Достоевский', 'male', 'd01')
('e005', 'Анна', 'Ахматова', 'female', 'd01')
('e006', 'Михаил', 'Лермонтов', 'male', 'd01')
('e007', 'Лев', 'Толстой', 'male', 'd02')
('e008', 'Антон', 'Чехов', 'male', 'd02')
('e009', 'Иван', 'Тургенев', 'male', 'd02')
('e010', 'Николай', 'Гоголь', 'male', 'd03')
('e011', 'Николай', 'Некрасов', 'male', 'd03')
('e012', 'Александр', 'Грибоедов', 'male', 'd04')
('e013', 'Иван', 'Бунин', 'male', 'd04')
('e014', 'Борис', 'Пастернак', 'male', 'd04')
('e015', 'Михаил', 'Булгаков', 'male', 'd03')
('e016', 'Владимир', 'Высоцкий', 'male', 'd05')
('e017', 'Александр', 'Солженицын', 'male', 'd05')
('e018', 'Максим', 'Горький', 'male', 'd03')
('e019', 'Николай', 'Чернышевский', 'male', 'd03')
('e020', 'Василий', 'Шукшин', 'male', 'd03')
('e021', 'Марина', 'Цветаева', 'female', 'd05')

In [37]:
try:
    sql_query='select * from departments'
    cur.execute(sql_query)
    print('dep_id', 'dep_name', 'emp_amount')
    for i in cur:
        print(i)
except mysql.Error as e:
    print('query error!{}'.format(e))

dep_id dep_name emp_amount
('d01', 'admin', 10)
('d02', 'purchasing department', 30)
('d03', 'research department', 50)
('d04', 'PR department', 20)
('d05', 'HR department', 15)

In [38]:
try:
    sql_query='select * from dep_room'
    cur.execute(sql_query)
    print('dep_id', 'room_num')
    for i in cur:
        print(i)
except mysql.Error as e:
    print('query error!{}'.format(e))

dep_id room_num
('d01', 701)
('d02', 702)
('d03', 703)
('d04', 704)
('d05', 705)

In [39]:
try:
    sql_query='select * from projects'
    cur.execute(sql_query)
    print('pro_id', 'duration')
    for i in cur:
        print(i)
except mysql.Error as e:
    print('query error!{}'.format(e))

pro_id duration
('p01', 3)
('p02', 5)
('p03', 20)

In [41]:
try:
    sql_query='select * from emp_pro'
    cur.execute(sql_query)
    print('empid', 'proid')
    for i in cur:
        print(i)
except mysql.Error as e:
    print('query error!{}'.format(e))

empid proid
('e001', 'p01')
('e004', 'p01')
('e006', 'p01')
('e010', 'p01')
('e011', 'p01')
('e012', 'p01')
('e013', 'p01')
('e014', 'p01')
('e016', 'p01')
('e017', 'p01')
('e018', 'p01')
('e020', 'p01')
('e002', 'p02')
('e003', 'p02')
('e004', 'p02')
('e006', 'p02')
('e007', 'p02')
('e008', 'p02')
('e010', 'p02')
('e013', 'p02')
('e016', 'p02')
('e001', 'p03')
('e004', 'p03')
('e005', 'p03')
('e008', 'p03')
('e009', 'p03')
('e010', 'p03')
('e014', 'p03')
('e015', 'p03')
('e016', 'p03')
('e018', 'p03')
('e019', 'p03')
('e020', 'p03')
('e021', 'p03')

In [40]:
try:
    sql_query='select * from salary'
    cur.execute(sql_query)
    print('emp_id', 'dollars')
    for i in cur:
        print(i)
except mysql.Error as e:
    print('query error!{}'.format(e))

emp_id dollars
('e001', 1000.0)
('e002', 600.0)
('e003', 800.0)
('e004', 800.0)
('e005', 700.0)
('e006', 500.0)
('e007', 900.0)
('e008', 500.0)
('e009', 550.0)
('e010', 620.0)
('e011', 600.0)
('e012', 650.0)
('e013', 550.0)
('e014', 700.0)
('e015', 740.0)
('e016', 540.0)
('e017', 600.0)
('e018', 660.0)
('e019', 560.0)
('e020', 580.0)
('e021', 580.0)

### ввод

In [43]:
# insert new employee
try:
    sql_insert="insert into emp_info (emp_id, firstname, lastname, gender, depart_id) values (%s, %s, %s, %s, %s)"
    data=('e022','Александр','Пушкин','male','d04')
    cur.execute(sql_insert,data)
except mysql.Error as e:
    print('insert datas error!{}'.format(e))

In [9]:
# insert new projects
stmt='insert into projects (pro_id, duration) values (%s,%s)'
data=[
     ('p04',2),
     ('p05',7),
     ('p06',21)]
cur.executemany(stmt,data)

### удаление

In [10]:
# delete employee
try:
    sql_delete='delete from emp_info where emp_id = %(emp_id)s'
    data={'emp_id':'e022'}
    cur.execute(sql_delete,data)
except mysql.Error as e:
    print('delete error!{}'.format(e))

### модификация

In [11]:
# move employee e001 from department d03 to d04
try:
    sql_modif='UPDATE emp_info SET depart_id = %(depart_id)s WHERE emp_id = %(emp_id)s'
    data={'depart_id':'d04','emp_id':'e001'}
    cur.execute(sql_modif,data)
except mysql.Error as e:
    print('delete error!{}'.format(e))

### выборка

In [12]:
try:
    sql_query='select emp_id,lastname from emp_info where depart_id = %s'
    cur.execute(sql_query,('d03',))
    print("Staff in department d03:")
    for emp_id,lastname in cur:
        print ("ID: %s,lastname: %s"%(emp_id,lastname))
except mysql.Error as e:
    print('query error!{}'.format(e))

Staff in department d03:
ID: e010,lastname: Гоголь
ID: e011,lastname: Некрасов
ID: e015,lastname: Булгаков
ID: e018,lastname: Горький
ID: e019,lastname: Чернышевский
ID: e020,lastname: Шукшин

In [13]:
try:
    sql_query='select emp_id,lastname from emp_info where depart_id = %s and emp_id in (select empid from emp_pro where proid = %s)'
    cur.execute(sql_query,('d03','p01'))
    print("Staff in department d03 & in project p01:")
    for emp_id,lastname in cur:
        print ("ID: %s,lastname: %s"%(emp_id,lastname))
except mysql.connector.Error as e:
    print('query error!{}'.format(e))

Staff in department d03 & in project p01:
ID: e010,lastname: Гоголь
ID: e011,lastname: Некрасов
ID: e018,lastname: Горький
ID: e020,lastname: Шукшин

In [17]:
try:
    sql_query='''select emp_id,lastname from emp_info where emp_id in (
                select empid from emp_pro where proid = %s and empid in (
                select empid from emp_pro where proid = %s and empid in (
                select empid from emp_pro where proid = %s)))'''
    cur.execute(sql_query,('p01','p02','p03'))
    print("Staff in project p01 & p02 & p03:")
    for emp_id,lastname in cur:
        print ("ID: %s,lastname: %s"%(emp_id,lastname))
except mysql.connector.Error as e:
    print('query error!{}'.format(e))

Staff in project p01 & p02 & p03:
ID: e004,lastname: Достоевский
ID: e010,lastname: Гоголь
ID: e016,lastname: Высоцкий

In [34]:
try:
    sql_query='''select emp_id,lastname from emp_info where firstname = %s and emp_id in (
                select empid from emp_pro where proid = %s and emp_id in (
                select emp_id from salary where dollars > %s ))'''
    cur.execute(sql_query,('Николай','p03', 600))
    print("Staff in project p01 & salary more than 600$ & firstname is Николай:")
    for emp_id,lastname in cur:
        print ("ID: %s,lastname: %s"%(emp_id,lastname))
except mysql.Error as e:
    print('query error!{}'.format(e))

Staff in project p01 & salary more than 600$ & firstname is Николай:
ID: e010,lastname: Гоголь

### JOIN

In [9]:
# employee & salary
try:
    sql_query="""SELECT e.emp_id, lastname, dollars FROM (
                emp_info e JOIN salary s ON e.emp_id = s.emp_id)
                """
    cur.execute(sql_query)
    for i in cur:
        print (i)
except mysql.Error as e:
    print('query error!{}'.format(e))

('e001', 'Жуковский', 1000.0)
('e002', 'Брюсов', 600.0)
('e003', 'Довлатов', 800.0)
('e004', 'Достоевский', 800.0)
('e005', 'Ахматова', 700.0)
('e006', 'Лермонтов', 500.0)
('e007', 'Толстой', 900.0)
('e008', 'Чехов', 500.0)
('e009', 'Тургенев', 550.0)
('e010', 'Гоголь', 620.0)
('e011', 'Некрасов', 600.0)
('e012', 'Грибоедов', 650.0)
('e013', 'Бунин', 550.0)
('e014', 'Пастернак', 700.0)
('e015', 'Булгаков', 740.0)
('e016', 'Высоцкий', 540.0)
('e017', 'Солженицын', 600.0)
('e018', 'Горький', 660.0)
('e019', 'Чернышевский', 560.0)
('e020', 'Шукшин', 580.0)
('e021', 'Цветаева', 580.0)

In [10]:
# department & room number
try:
    sql_query="""SELECT d.dep_id, dep_name, room_num FROM (
                departments d JOIN dep_room r ON d.dep_id = r.dep_id)
                """
    cur.execute(sql_query)
    for i in cur:
        print (i)
except mysql.Error as e:
    print('query error!{}'.format(e))

('d01', 'admin', 701)
('d02', 'purchasing department', 702)
('d03', 'research department', 703)
('d04', 'PR department', 704)
('d05', 'HR department', 705)

In [ ]:
con.commit()
cur.close()
con.close()